[
    "Chapter 1 Privet Drive. The ominous fog makes the night-time even more hoary and mysterious than usual here in suburban Britannia. Out from the shadows of God knows what dimension steps the oldest wizard in the books, the Near-Dead Dumbledore. He is clearly a powerful beast and walks with dignity despite his age and attire.",
    "He sees a cat that he knows right before he sets to work. He produces a wizard's tool known as the Street Darkener, and, with a practiced angling of the arm, begins to siphon away the clarity made from mankind's bulbs. Magical deeds are afoot, dear readers, magical darkness a must.",
    "The atmosphere complete, the cat, now protected by shadows, transforms into who else but Professor Hardcastle McCormick, an old friend and ally of Dumbledore, the Half-Dead. She is truly a great wizard, also, and possesses many a skill that might aid in to-night's random errands.",
    "They speak gravely of to-night's horrible decision. And, dear readers, trust me, their work to-night is dubious. What are they to do? Are they really going to go through with to-night's desperate plan? The choice is clearly in powerful hands, as Dumbledore ponders with his gigantic brain.",
    "Just then, a light approaches in the clouds. Shredding through the stratus descends no other than Hagar the Horrible, a huge man that, if you didn't know better, you may mistake him for a giant, hairy truck. He is Dumbledore's gofer and now, perched upon his sky leopard, Hagar seems at the end of an errand that has almost bested him.",
    "But lo! out from his manly pap, he produces the most powerful baby in the universe. Dumbledore accepts the swaddled child like the delicate button of an atomic bomb. His bowels tense. No false moves here.",
    "Hardcastle McCormick pleads with Dumbledore not to go through with the plan. What plan, you ask? Well, they are going to leave this veritable weapon of the gods, this paradox of baby-ness and power, right here, on a frickin' Muggle's doorstep!",
    "But 'shhh', says Dumbledore to the baby, and 'shhh', he says to the lady. As Hagar gnashes his teeth in inner conflict and almost drowns in snotty, fearful tears, his master Dumbledore tells him to wait in the frickin' car if he has to.",
    "And the baby is left, the baby with the most telling of scars, the baby that is the seed of power, the baby that is the inheritor of the horrible, hoary hammer of the gods, Harry, the wizard who was destined to vanquish all evil, and, if he so wish, bring it back again!",
    "Harry Potter and the Sorcerer's Stone!",
    "Chapter 2 Harry Potter wakes to the sound of his evil aunt banging on his bedroom's tiny door. His adopted family treats him so poorly he can barely keep from incinerating them with any number of spells he keeps hidden way up his sleeves.",
    "Harry's room is cool, though. He's clearly made the most of it, unlike his cousin, Roast Beefy, whose birthday happens to be to-day. The cousin has no idea of the power he is toying with. He is indeed a mean little puke, who is borderline retarded and must shout moistly every stupid sentence he manages to piece together.",
    "As Harry prepares breakfast, totally magic-free and labour-intensive, his vomit-inducing uncle, Giggle Snort, looks on as the evil mother does the Blind Man Birthday Dance with Roast Beefy. The living room turns out to be full of presents for the nonplussed Roast Beefyweefs.",
    "Of course, it is never, never, never enough. Chunks of demands splatter on his parents' faces. Harry must stay calm and repress his urges of igniting the house in a demonstrative fireball, ending the life of these three little pigs. But our wolf remains cool.",
    "To-day the family is going to the zoo, and on the way Uncle Pig Fat sinisterly suggests a beating to Harry if he sees any kind of magic out of him. Oh ho, dear reader! It looks like Uncle Salt Porker has some idea of our hero's magical brain. His face is the worst.",
    "The family seems to be happy with nothing. A giant Burmese leopard-eating snake basks in front of their piggish faces like a poem, and, of course, they want it to dance for them.",
    "But not our Harry. The sweet wizard in remission is psychically linked with the beautiful snake-being, having dreamt himself of eating leopards, boars, and dik-diks. And what do you know? Harry can actually speak with this creature! Will his talents ever stop emerging? Harry, with the social grace of a saint, is relating with the orphaned, captive, pig-hating snake.",
    "It is a beautiful moment, indeed, and Harry, for once, feels in tune with the natural universe. The snake has no parents, is dangerous, and is beautiful. Harry sees himself here, in this snake, like looking at his image in the mirror. It is a perfect moment.",
    "But Cousin Roast Beefyweefs notices some action, and runs over to spoil it. Harry totally loses it and frags Roast Beefy good with a Glass-Be-Gone Spell! Wah-ooosh! The terrible cousin spills his ass into the cage as the supine beast nobly erects itself out and is thanking Harry as he slithers into the nightmare hearts of all of the Muggles nearby. Everyone is afraid of this beast but Harry. Of course: Harry, who seems to be part of the natural universe now.",
    "And what do you know, dear reader? Providence must have cast a Glass-Be-Back Spell! Because take a look at the zoo's new acquisition! It is a play, a tragic comedy, the lament of Roast Beefy O'Weefy! Ha ha! The family Porkums is hit palpably with shame. Yes, Harry, do laugh on. Laugh right in their unthinkable faces.",
    "Chapter 3 As the Hog family enter their home to regroup after Harry's formidable blow, Uncle Porkflaps tries to tear Harry's wig off, before remembering that Harry is a boy, and, probably, his hair is real.",
    "'No more magic!' his throat rasps without its usual gravy lube. Realising his throat is foodless, Uncle Piggums exits for the kitchen.",
    "In the following weeks, Harry falls into a depression. He feels like an exile here in this world. He feels alone and hated. But Harry, going about his innumerable chores, picks up the mail, only to be bowled over at the discovery of a letter addressed to him!",
    "'A connection is trying to be made', he thinks. 'Somebody needs me.'",
    "Having delivered the mail, Harry tries to conceal his letter, but Cousin Ragtime Roast Beefy thinks that Harry has a possible cookie or wafer and takes away the letter before Harry can open it. Uncle Piggums inspects the letter the best as he can with those eyes, and a phantom of fear crawls across his goutish face. Harry wonders what could be so wonderful.",
    "In the next few days, a miraculous event unfolds. Birds from every breed and fashion begin to crowd the Pork 'n' Chips' home with letters addressed to Harry. The uncle is beginning to feel the pressure. Harry, in a spiral of depression, turns to the escape of the world of miniature equine aficionada. He produces many a Wine-out-of-Nowhere Spell and is drunk every day before noon.",
    "He is only half-aware of his uncle's battle with the birds. The aviary horde perch on everything perchable, tarping the yard, car, roof and all in hawker-like bird waste and, of course, the letters. Every bird revels in the madness it is inducing on Uncle Saltporker. The house, under drifts of letters, molting, and bird shit, now pushes the uncle to burn anything that is represented on paper.",
    "Harry, through a cloud of wizard magic and stealthily-pinched Valium from the evil aunt, notices his uncle fraying.",
    "One morning, while doling out biscuits, Harry listens half-heartedly to his uncle's plans of a giant cat to be unleashed upon his feathery foes, but Harry's attention is drawn to the window.",
    "Sunlight. Harry could almost cry at this simple gift of the universe. If it weren't for these awful people, he would cry, but he must not show weakness, or else they'll hand him his ass.",
    "He tries to focus on the yard, and the birds and, 'Why are they trying to contact me?'",
    "These facts make their way in through the jungle of a consciousness, just as a veritable fountain of bird-propelled letters issues forth on to the family. Harry decides that this is it.",
    "'This is the moment! I must make my move in this masking of a snowstorm, and I will take one letter into my room and whisper it to my horses and see what they think!'",
    "Oh, how the wine talks. But Harry cannot make it to his tiny door. Even impeded by the onslaught of letters, the now totally-bonkers Uncle Porkstar crashes down on Harry. The battle that would have been is now a sad display, Harry at the drunken bottom of a depression well, and his once-formidable foe mindless and flailing.",
    "Chapter 4 A crushing blue night lays upon the sleeping Porksters as Harry, awake and active, plays out his happiest of sad moments. Sigh. His birthday, of course. But who could care? Especially out here, where love is dashed upon the rocks like a rose given as an insincere apology. Love. Don't give up on it, Harry! Make a wish upon it, upon the stars.",
    "But Blam! Blaam! Blaaam! at the door. The Porktown family scuttles into position, but what busts in the door is far more than expected. It is Hagar the Horrible, the nightmare of hair, a wall of a man. But buried under his woolen chest is a heart that I'd trust a baby with. After politely shutting the door, Hagar turns to the squawking uncle and aunt.",
    "His face is a mask that displays he is no mood, and he bends the gun that is pointed in his face straight in half. A bullet ejects into the heavens interrupting an angel's sleep. But, oh no! Harry! Hagar confuses Roast Beefyweefs for Harry! No! Don't take that chili barrel to Hogwarts! Then Harry rolls into view.",
    "'I am Harry.'",
    "Now, if you cry easy, be careful here, dear readers, for Hagar produces for Harry his first-ever birthday gift. It is a cake, handmade, no less, with love, by a warrior of the wind.",
    "'Who are you, nice man?' Harry asks, feigning a child's air.",
    "Hagar says, 'Hagar', and tells Harry that he is the gatekeeper and keymaster at Hogwarts. Harry is confused, though he knows how to play his cards. A man like this could be in the market for a sidekick.",
    "'What's Hogwarts?'",
    "A masterful play by Harry. Hagar stumbles around with words and seems put off a bit at himself. Clearly, sidekicking for Hagar would suck balls. Hagar can't contain it anymore, and just drops his secret: 'You're a wizard, Harry!'",
    "Harry, with the talent of Laurence of Olivier, feigns surprise.",
    "'Um, I can't be a wizard, I'm just . . . Harry!' Again with the oil of Olivier.",
    "'Well, \"just Harry\", I imagine, then, that lions are just lions, and gods are just gods. You are a special boy. You don't know it, but you and I go way back.'",
    "Oh, Harry wishes that he could have a glass of wine or something right now.",
    "Hagar gets up from the couch and produces a letter. It is clear now that Hagar is a bird-friend for, indeed, the letter is the same as before. Harry begins to read.",
    "'Come to Hogwarts and become a wizard, Harry Potter', it says. He reads, thus, aloud. Uncle Baconface races in to interject a spit parade which Harry translates into a most disturbing disclosure: the Pigs knew all along! They knew that Harry's parents were wizards, of course!",
    "And now, the sickest, pinched-up mouth of an aunt lets out that Harry's parents did not die in a car crash, but were, of course, destroyed in a much cooler way: a wizards' fight. She begins then to berate Harry's mom, calling her names, and trying to say that Harry sucks and stuff like that. Her venom is sharp; sucking is nothing Harry wants to do.",
    "Hagar then steps in, seeing that Harry is in no state to argue for himself. 'This night is going to end good for Harry. End of story.'",
    "As Roast Beefaweefs grabs Harry's cake and begins to munch it, Hagar describes the Pigs as 'Muggles' to Harry. Music-hating, magic-less Muggles. He lays down the law on Harry's schooling: a big fat Yes, he's going. Hagar also goes on to say that the great Dumbledore is the teacher at Hogwarts, and will make Harry into a man and stuff.",
    "Uncle Fat Train spews a slander on Dumbledore in return, and Hagar gives him a truly horrible face, and points his magical umbrella, and starts to say a spell like Don't-Ever-Talk-Again-Fatty. But the slobbering, smacking jowls of Roast Beefyweefs interrupt him.",
    "And Zap! goes Hagar with the umbrella. And Voila! a curled up Cheeto shoots right out of Roast B.'s bottom!",
    "'Woo-hoo!' shouts Harry. 'About time he burst that Cheeto! He's been trying to birth it for years! Hm hm hm!'",
    "Hagar takes a sip off of what has to be whisky and hands the flask to Harry. Harry takes a giant pull, and then Hagar says, 'Let's get out of here. You like flying motorcycles?'",
    "Harry replies, 'Anything's better than crawling.'",
    "They both laugh and hold their bellies like two Santas on opposite ends of the scales. Harry gathers up his worn-out shoes and stuff that he wants to take with him.",
    "Chapter 5 Mid-day London. Whilst walking in broad daylight with Hagar the Horrible, Harry bravely reads his syllabus's demands.",
    "'Wand, magic sand, one Turkish massage owl . . . where can I ever obtain such obscurities?'",
    "Hagar makes a knowing 'O' shape with his hairy lips and directs Harry into a nondescript, black, plastic business.",
    "A bar? Hagar the Horrible, you'd better know what you're getting Harry into. Of course, the barkeep knows Hagar's bar-darkening frame.",
    "'Hello, Hagar.'",
    "'Hello, Hagar.'",
    "It comes from all directions.",
    "'You want some beeeer?'",
    "'No, that's okay. I have Harry Frickin' Potter with me to-day, and we're doing some shopping.'",
    "The bar inhabitants crane their boozed-up eyeballs into view. They all want to see the legend of Harry P. Old women, leathery hats, and grizzlied madmen pinch themselves under the tables to make sure that they are not dreaming. Harry handshakes with all.",
    "The Defender of the Dark Arts teacher from Hogwarts School presents himself. His name is Professor Queerman, he stutters, clearly a fan of Harry. Harry makes a series of heartwarming gestures in an effort to calm the star-struck prof's nerves. Harry is a soothing gentleman, and Queerman seems to feel at home in his presence.",
    "But Hagar moves along the business, for they have tons of shopping to do. He leads Harry out the back door and into what appears to be a dead-end alley.",
    "'Hey, how do all those people know me back there?'",
    "'You want to do some shopping or what?'",
    "A Masonic pentagram is described by Hagar on the brick wall, and Shazam! the doorway to a magical world is a-folded back, brick by brick, in an orgy of Transformers for Harry's brain to take in. And ah! Welcome to Calgon Alley.",
    "Dear readers, imagine music: la-de-da-de-da, alive and market-placey, and violins, taking a break up in the air with non-threatening amblings, and a wreath of tambourine, just lightly jangled. Enter scene of what looks like 1800s England, downtown; buildings crowded in unstably around tons of magical kids with their parents, scraping together their needs for the upcoming school year. We have witchy moms, and wizardly dads, and worried, hurried Harry acting excited and happy, for Hagar's sake.",
    "'Look! A Turkish massage owl! And look! It's a bat! Sweet moustache! Willikers!' Harry watches kids breaking their nose cartilage on the window-panes of broom stores.",
    "This is Heaven.",
    "Chapter 6 'I'm broke, Hagar. What do I do? I want that broom back there.'",
    "Hagar happily extends a finger at the goblin bank of Wobble-Columns.",
    "'You got an account up in there, Master Harry.'",
    "They enter the foyer among evil, pasty, Hobbity, Ufgoody goblins. They are running the money show, clever turnips, these needleteeth. Imagine a human of about three years of age with antler-like nose and ears, and a jellyfish draped over its head, then stuffed into a leprechaun suit.",
    "Hagar prompts the nearest leprechaun teller for a withdrawal from Harry's account. The leprechaun, famousness of Harry aside, demands Master P.'s bank key. Luckily, Hagar, the keymaster, naturally produces Harry's key.",
    "'What else of mine does he have?' Harry ponders.",
    "Now pay attention, dear readers. Hagar then very earnestly gives the leprechaun an envelope and says that it is from Dumbledore and that it has to do with 'that vault', 'that special vault'. The goblin is in time with Hagar and they know that this is grave business.",
    "Soon, they are riding to the vaults on a roller-coaster. The grossest looking humanoid in the world tries to scuttle around on its moon-shaped limbs. It tries to remain cool, and orders Hagar and Harry to follow it.",
    "It unlocks the door and backs away trying to resemble what it thinks is a cool-looking person, but, in reality, it is freaking Harry and Hagar out miserably. The door to Harry's vault swings open and right away starts to blow the socks off Harry P. Hagar makes noises out of his mouth but Harry is not available. The piles of gold that are his instantly make everything beautiful for Harry.",
    "'It's going to be okay', he thinks.",
    "Now on to yet another vault.",
    "'More of my gold?' Harry thinks.",
    "The leprechaun lifts a clawed finger up and down, tickling the door's back enough that it unclenches in its threshold and swings open, not to reveal a pile of treasure, but to reveal a silly little gunnysack. Hagar walks in, snatches up the gunnysack, and stows it away on his humongous person.",
    "'This is between you, me, and the little Paddy McGrossOut, okay, H. P.?'",
    "Harry nods.",
    "Chapter 7 Back on the shopping tour, and Harry needs a wand.",
    "'Go up in Ed Vanders'. I've got to attend to a few other details, and I'll meet you in there later', says Hagar.",
    "So Harry enters Ed Vanders' Wand Emporium. The shop is full to the ceiling with wands.",
    "'Which one to brandish? Which one to call my psyche's extension?'",
    "Harry irks out a few husky hellos.",
    "'Hello?",
    "'Hello?",
    "'Hello?'",
    "But Jeepers! Ed Vanders rushes into Harry's view like a scarecrow's carcass, a dreadful visage, indeed. And a ghastly voice: 'Harry Potter, welcome.'",
    "Master H. is beginning to feel animosity towards his own celebrity. Harry gazes at the man's skin, a ketchupy callous of a face.",
    "'I will make spells that will save me from looking like him.' Harry makes that mental note, I assure you. The mental notes are stacking.",
    "Ed Vanders produces a wand that he thinks is suitable for our Harry, but, on the first try, Harry totally frigs up half of the store with that wily stag of a twig.",
    "'His stockpiles of nuclear-level energy will be funny and tricky to funnel', thinks Ed Vanders.",
    "Vanders is tenacious. He pokes around in stacks of wand boxes for round two. A bigger wand, he suspects, will be suitable.",
    "Harry, now bored and tired, brandishes again, but Kabloomers! Destrucción!",
    "Vanders, with a Why-Didn't-I-Think-of-It-Before? look, the look that everyone's dad puts on when he's trying to pick out shoes and clothes for their kid, even though they have thought of this before, from the beginning, in fact. They just want to draw out the afternoon with needless driving around and tryings-on because they don't know what else to do with their kids. Well, Vanders puts on that kind of a look and music galore fills the shop.",
    "He stands in front of Harry like some freaking Amadeus. He is no doubt imagining our Harry as his orchestra. And Vanders is flabbergasted at how good of a choice he has made. He starts to whisper like a thespian in a particularly juicy role.",
    "'This wand's brother is the wand of that scar-maker, the guy who gave you your famous scar.'",
    "Harry almost dookies a shooter but controls himself. Harry is sick of whispery games, and he says, normally, 'What is this scar-maker's name?'",
    "Ed Vanders all but holds up a skull and soliloquies, 'Oh, we don't say his name, but know this: he is a badass. He can kill anyone, anything. A gorilla or a bear, whatever, anything. Anything but you.' Ed Vanders, wasteland of a face, crowds in close. His monologue is stinky. 'You are in a great position. You are an army of wizards, Mister Potter. Use yourself wisely.' His breath cascades over Harry's unbreathing nose.",
    "'How long must I go without an intake of air?' thinks our Harry. It is the only thought that consumes his brain.",
    "Finally, breaking the mood, Hagar taps the window. Holy balls! He's bought the Turkish owl! Hurrah!",
    "Chapter 8 Hagar and Harry sit eating supper in a foggy, wine-spewed inn. The depression creeps into Harry again. His powers seem infinite, everyone loves and fears him, but he himself can't seem to find his place among them. He is outside of people, and the wine flows. So, in an effort to cheer Harry up, Hagar decides to tell the tale of Harry's parents' death.",
    "'Valmart is the name of the scar-maker', he whispers. 'He is a wizard with uncanny powers, but this guy is so evil, as soon as he came out of the womb, he put a scar on his own forehead. Well, Valmart went to Hogwarts and started the Dark Side Club. It was actually the coolest club to be in, at first. Everyone got a kick out of being in a club that stories were told about. You know, that's all anyone ever does anything for anyway, the sake of a story to be made of them.",
    "'Well, you can be sure that Valmart earned his share of stories. You know, the club got strict: you had to love evil and not be shy about using Murder Spells, or else you'd be murdered. And your parents were some of the people who decided not to kill for fun.",
    "'So Valmart went to their house and killed them, and, while he was there, he tried to kill you. But the spell ricocheted off your head and hit him instead. Now, no-one knows if he's dead, or hiding, or hiding as someone dead, but what's for sure is that he hates you for not dying. And it's sure that, if he is alive, he'll try to finish off the job, probably when you are sleeping, and he'll probably look like someone you love, just to make it worse when he murders you. So, you know, be on the look out for that, and, you know, be careful when someone loves you.'",
    "'Gulp', says Harry.",
    "Chapter 9 Whilst walking to the train station, Harry begins to feel the stomach butterflies accumulate. Hagar is then just stunned by the time of day. He must get that gunnysack to Dumbledore! So, he gives Harry his train ticket and then just totally freakin' disappears on him.",
    "Harry then thinks to himself, 'What the hell is meant by 9 ¾? Platforms aren't broken up that way. Willikers!'",
    "Harry feels dreadfully alone at this point; but then again, in a way, it is a thrilling sensation: here he is, a young lad making his way in the world to-day. The stacks of gold coins in his pockets ease his worry.",
    "Carting along the Turkish owl and luggage, Harry makes his way up to interrupting a station man, only because he is afraid he might miss his train.",
    "'Excuse me? Where's Platform 9 ¾?'",
    "'Fudge off, you fuck', says the horrible man.",
    "But thank God for the Irish! Harry overhears the red-headed mother of a red-headed herd of children speak wizardly, and he knows he's in luck.",
    "'Follow them, Harry', Harry says to himself. 'Follow them or die.'",
    "But watching them from a distance, Harry sees one boy, cart of luggage and all, disappear right into the brick wall between the ninth and tenth platform.",
    "'Holy balls, I am not doing that', he thinks. 'Willikers!'",
    "But some more kids whoosh through, and another, and yet another, and Harry's nerves begin to settle. So, finally, he goes up to the mother and begs a lesson.",
    "'Excuse me, Irish lady, can you show me how to do that?'",
    "Here, in the presence of such an honest and loving family, Harry feels immediate, latent, Helsinki syndrome withdrawals for the Pork Family Project. He quickly shakes them off when the mother sweetly crimsons his bottom, and in Harry goes like a reversal birth, into the negative plane of the brick wall that stands ominously in front of him. He overcomes the obvious fears attached to this little test, and is on the correct platform. Ta-dah, ta-dah, ta-dah forever!",
    "'Well bless my nippers!' cries Harry. 'Bless them all day long.'",
    "He stands in awe of the steaming engine, the train that shall propel him to the stage that he was born for, the Hogwarts Express.",
    "Chapter 10 As the Hogwarts Express drags along the countryside, all the kids' hearts race in time with the engine. The scene is so beautiful that the landscape is literally peppered with painters working out masterpiece after masterpiece.",
    "Ronnie the Weasel shows up and makes his grand entrance to share the compartment with Harry. The proud lad remembers Harry from the platform and takes a seat. In the introductions, Ron is struck with a face almost sacred when Harry introduces himself as the H. P. The scar is called into question. It is shown, and it is wicked.",
    "The food service wench appears. Ron, obviously from a family whose money is spread thinly over a vast volume of loin product, cannot buy a thing. But the newly-minted Monopoly champ H. P. flashes some coin, and the new friends celebrate over a pile of cakes, and frogs, and nipples of Witchy Venus, and rats, and chocospells, and fruitnuts. You know, wizardly fodder, the same kind of junky food you and I would wallow our mouths upon if we were in Harry and Ron's place.",
    "Ron, Ron loves Twizzlers. They talk over the syllabus and what's to be demanded of them at Hogwarts.",
    "Ronnie tells Harry that he is a pot-of-coffee-by-day, bottle-of-wine-by-night type of guy.",
    "Harry says, 'Triple that, and you got me.'",
    "They laugh a congenial laugh and both of them realise that they are instant friends, friends forever.",
    "Just as Ron is about to produce yellow pillows, a spell he has learned at home, pillows of gold, he and Harry are interrupted by a horrible creature that is noisily and slowly making its way down the hall and finally appears in the doorway. Only upon closer examination do Ronnie and H. P. realise that this thing is a girl looking for somebody's frog.",
    "Her hair seems to be made up of hair-follicle-sized serpents. A pre-pubescent Medusa. She demands that Ron finish his spell, but, by mere proximity to such a wretched creature, Ron cannot concentrate, and almost kills his rat instead of producing pillows of gold.",
    "She tries to degrade Ron, but only looks stupid. Knowing that these boys obviously hate her filthy guts, she sits down and repairs Harry's glasses with a pretty cool spell. The boys have to admit that this creature posing as a humanoid has some chops. Definitely some chops, indeed. Only after the spell does she recognise our H. P. for who he is.",
    "She intros herself as Harmony and begs Ronnie of his name, but he only growls and smacks in her direction. This prompts her to leave, and, as a last ditch effort to please, she informs Ronnie of his chocolatey nose. As if he did not know.",
    "Chapter 11 Finally, the moment of truth! The God Wheel of Fate has stopped for all these kiddies on Yes, Yes In-Fucking-Deed, You Will Be a Wizard! And this moment is the first in a series of moments that, no matter what feelings those moments embody, Yes, Yes is still the answer. Yes to life, and Yes to magic!",
    "Just look at their faces, look at their auras. They are aglow.",
    "Dear readers, imagine a music that describes a nocturnal, heavenly Yes as the children float on the black, still waters, boating up to the castle of Hogwarts School. Harry knows straightaway that this will be a place where he shall surely brandish his wand valiantly. He knows in his heart that this is a stage where he will conjure and conquer the world with his ungodly charisma points. Harry trembles and steadies himself in the reassuring, pasty presence of Ron the Bear.",
    "This moment of Yes consumes our Harry. He feels here that he is the thing of stories. And, for this, he nearly weeps a frenzy of weeps.",
    "The kids make a formation up to the school's entrance. They file up the main staircase and are met by none other than Professor Hardcastle McCormick, rasping her fingerbones in withering patience as the children gather beneath her on the frontmost staircase.",
    "She speaks about the school and explains that the class here, now, will be divided into four different, competitive schools. Her voice is chilling, like a piano made of frozen Windex. Her eyes float like smears of fish scales on her candle wax stump of a head. She goes on to describe the systems of points and demerits, house cup, et cetera. Snoozers. All the kids are too tired to listen.",
    "The professor drones on in a dead parade about different alumni that everyone should remember, but is interrupted by a child named Upfish, who finally finds his frog. A victory for Upfish! but a staggering loss of control for Hardcastle.",
    "Clearly not knowing how to pull it back together, Hardcastle takes her leave. A dreadful kid with sunburned hair notices Harry somehow, and calls him out in front of everybody. The murmurs begin.",
    "Like a cowboy, he saunters up to get a closer look at our H. P. He intros himself as Mouthoil, and, of course, Ronnie busts up at this. The rich little bastard starts throwing class trash about Ronnie the Bear's hard-earning family being poor and rabbit-like. Of course, he goes for the Shame Spell.",
    "But H. P. gets Ronnie's back by issuing forth a comment or two so deft I cannot even start to reproduce them here. This trumping does wonders for Harry's initial cred here at Hogwarts.",
    "Chapter 12 The children file into a glorious cafeteria where all the other pre-sorted students and teachers are awaiting the ceremony. A welcoming flute song accompanies their entrance as candles float in mid-air under a ceiling that appears to be made out of glass entirely. The night sky whispers an adjustment to the clouds above them.",
    "The faculty table is full of weirdo professors, and goblin-faced women, and there are floppy and pointy head decorations, the true markings of master magicians.",
    "Hagar, Cromley, and friends sit awaitingly. Professor Dumbledore erects himself slowly and tells some jokes about death that most of the kids just don't get. He then, after warming up the crowd, introduces the Blood-Eyed Cat that is head of security, and then introduces the cat's manservant, Dazzler.",
    "He then closes with yet another joke about death, perplexing some, and just plain scaring most of the kids. He sits down, finally.",
    "Hardcastle announces that it is time to begin. Her manners are that of a jilted lover's I-Didn't-Love-Him-Anyway sort of mood. The Child Sorting Hat Ceremony begins with the Wretched Harmony.",
    "A wise child she is, and reminds herself not to freak out up there in front of everyone. The poor thing has complex on top of complex. She perches on a seat up in front of all the kids, and Hardcastle places an oogedy-boogedy hat on top of her hair. It grind-dances on Harmony's head, and grumbles pleasurably, 'Gryffindor.' Applause all around, and Harry thinks to himself that this will be a long, long night.",
    "Next up, Mouthoil is called to face the grinding hat, but, before his ass cheeks can even start to pancake out on the stool, he is assigned to Slytherin.",
    "Some other kids get up and have their fates directed, and, right then, a wicked woman casts a look at Harry that makes his scar hurt. Ouch! This is the weirdest woman Harry has ever seen, a dark, foreboding weirdo that Harry feels certain will be the kind of teacher that paddles for fun.",
    "Ronnie the Bear is next up for the hat. Ronnie is sure that the hat will bear down on him and hunch away at his scalp for nothing. I mean, everyone knows that Weasels are put into Gryffindor. Ronnie's twenty brothers and twelve sisters are all Gryffindor students or alumni or faculty.",
    "The obvious is true: Gryffindor it is.",
    "Professor Hardcastle tries hard to say 'Harry Potter' like it is no big deal, but the room goes quiet. Everyone edges in to see and hear what is going to happen next. The rustle of bets and cash is muted between robes. Harry doesn't want to bunk with Mouthoil, but that hat starts in about Harry's potential and near limitless talent, and how it could blossom wickedly in Slytherin School.",
    "Oh, Harry only winces at this constant bombardment of pressure to impress. This damned hat! All these fucking kids and teachers looking at him like he's a fucking television!",
    "'Oh, fuck it! Just don't put me with Mouthoil!' is all Harry keeps saying to the hat. Finally, the hat's oscillations tense and release upon Harry's scalp.",
    "'Gryffindor it is!' it announces.",
    "Yes! The universe sighs its magical sigh.",
    "Harry is congratulated wildly by all his new bunk-mates, but he feels numb and distant. A knowing glance is shared between the Near-Dead Dumbledore and the virile youth.",
    "Harry just hopes he can pound a few cold ones.",
    "Chapter 13 Dumbledore casts his Stand-Without-Effort Spell, following it up with his most pleasing Food-of-Plenty Spell. If ever a room full of children has looked like little hyenas that have come upon a dead family of zebras, it is now.",
    "Piles of glitzy meat and sweetbreads appear. There are sweaty corns and honeyed everything. Talking bones loosen and Harry relaxes into a wine-ish swagger.",
    "He talks closely with his R.A. 'Hey, who the fuck is that woman over there? She's got to be a half-troll.'",
    "The R.A. replies, 'No, that's Professor Snake. She sucks for the most part, you know, acting mysterious and theatrical.'",
    "'God, I hate that shit,' replies Harry. 'I'm here to learn, not to watch a performance.'",
    "Just then, the conversation is busted up by a breeze of hilarious ghosts. There are women ghosts and musketeers. Little John the Ghost shows up and demands a song of farts, or else. The Count of Reeds whips lashingly every child in the face. No-one is able to escape his moustached giggle.",
    "A ghost dance begins, and the kids watch as a transparent mashing of flashdances and footlooses fogs up the rafters of mealtime. At any rate, every ghost becomes bored, and evaporates either into the walls or out through the ceiling, and every student's belly is distended with jelly, wine, and pudding pops. The dinner is over.",
    "The R.A.s guide the new Gryffindors into the stairwell. The staircases are a maddening, mobile architecture that forever fucks up the students' days by moving here and there without warning.",
    "The kids climb stair after stair, ad infinitum. Some talk about art, others simply concentrate on not vomiting from the intense vertigo.",
    "After all of the wine and the meat that all of these children have eaten, they're just hoping to finally get to their rooms so that they may use the potty and acquaint themselves with the water closets.",
    "They file in front of a painting of the most beautiful woman ever around. The R.A. says the code word, and the lady in the painting loosens her perfect tongue in her mouth and beckons everyone present to enter.",
    "Beyond the painting lies the Gryffindor parlour. Smoking, cards, and night-caps will all be the room's main functions for the kids, the R.A. goes on to explain. Every one of these kids' parents once relaxed and bonded here, by this very fire.",
    "All eyes are heavy. The day has been a storm of excitements, and the children, after laying out their uniforms and shoes, are quickly starring in each other's dreams.",
    "It is a beautiful pale-blue night. All the children are burritoed up in their blankets. All except for Harry. Amid the semi-sweet chomping at head-gear, we see Harry, stroking his bird, lost in thought, bathed in the cold water of moonlight.",
    "'Who am I now?' he thinks as he winks at the night. And it seems to whisper back to him, 'You are everything.'",
    "Chapter 14 Harry awakes to yet another tequila sunrise. He and Ronnie the Bear are lost and late for their first class. But when the boys stumble, out of breath, into class, they are delighted to find that the teacher is either late or just out for coffee. But, in unison, their faces scream, 'Holy freakin' balls!' as the cat has been Professor Hardcastle this whole time! Willikers!",
    "The professor puts together a clever witticism about tardiness and George Washington's trees full of cherries, and Harry makes another mental note: Never pet cats that you don't know, no, never pet anything.",
    "The potions class's door is thrown dramatically open, and in dances that black hole of a woman, with a scar-aching glare. She leans with her best effort to strike an attractive pose, while beginning to whet her students' appetites with a taste of what kind of rhetoric could be expected here. The stark impossibility that such a thing could be human, not to mention a human that Harry has to pay attention to, is only matched by Mouthoil's apparent infatuation with her. They look into each other's eyes like two serpents on a honeymoon, Professor Snake, astonished that she has an admirer, and Mouthoil, astonished that he likes women.",
    "Snake, seeing now that Harry is not paying attention to her mouth's every shaping and massaging of notey syllables, calls him out and rags on his celebrity in front of everyone.",
    "Harry is surprised, for he was only taking notes intently. Then, Snake demands from Harry how to make a certain spell. Harry good-naturedly says he just doesn't know. I mean, how could he? This is his first day! Christ!",
    "Driven by some unholy jealousy, the unfair Snake presses him again. 'What is such and such?' Or, 'How many rat tails are in minkerfoils?' 'Produce anti-matter.' Again, Harry, with the oil of Olivier, acts humble, demure even, thankful for the lesson. He controls his urge to slay Snake's ears with a few fiery riffs off his wand. Snake finally subsides with her onslaught. She stupidly feels she has cowed our Harry.",
    "At lunchtime, the kids relax and compare first impressions on teachers. Ronnie the Bear tells Harry that he could hardly stand watching him cow to such an asshole back there. Harry explains to the Bear that subtlety and patience are a great way to look pretty cool. The Bear has to agree, and they give each other Fonzie looks.",
    "The rest of lunch is spent on mail-reading, which is delivered by a host of birds that we, the readers, are already duly familiar with. Some kids get letters, others get ornaments that quickly fill with the mother's blood. Some desperately wait for their letters to arrive, which shall never, for they are the type of kids that mothers just never write to.",
    "Harry opts to read the paper.",
    "Now, dear readers, if you've ever paid attention to me, now is also a good time. Harry reads aloud to Ronnie and Harmony that the leprechaun bank which he had been to earlier on has now been broken into. It was the same vault where that gunnysack had been. It was busted into by what are suspected to be Black Art wizards from Valmart's order. Jeepers! But, of course, the gunnysack was gone before those robbers got there.",
    "The kids seem to smell the beginnings of an adventure here in these facts, the attention-starved Harmony most of all.",
    "Chapter 15 Outside, Harry's class awaits their first lesson in broomstickers. Being that this is the last class of the day, the kids are anxious to get rowdy.",
    "Finally, Professor Meowmers takes her position in front of the class. This morning, Harry does have one thing in common with Mouthoil, his mood, a mood of annoyance and pity for his frustrated, easily astonished, and shallow peers. Of course, Harry commands his broom with ease, and, like the beginning of 'Dueling Banjos', so does Mouthoil. Harry later will be displeased with himself for hating everyone to-day: Professor Catface, Mouthoil, Tony the Shrimp, Facer, Yellow, Otter Pop, and, yes, even trusty sidekick Ronnie the Bear.",
    "Whilst Professor Catface Meowmers barks orders, Harry drifts off into his imagination. He lets his mind's eye take him on an inward exploration. He sees before him a giant cake. A wedding cake. His parents' wedding cake. And he wants to eat it. But then he realises that this cake is Dumbledore's hat, and, to reach it, he must climb up Dumbledore's body, using the old ribcage, and mouth, sockets and such as footholds. But before he can get halfway up the rickety old scaffolding of a man, degrading the saintly professor with his imagined dastardly feet and thumbs, he sees that the cake is, indeed, rotten, black, and toppled, obviously forgotten over the years, and adopted as a hat for reasons unknown to such a first-year as Harry. The daydream is a weak attempt to stay amused during these Idiot Guide-styled classes.",
    "As H. P. comes out of his reverie, he is amazed to see that his friend Upfish has had some sort of serious accident. Professor Catface gingerly escorts Upfish away from all the jeering urchins and up towards the nurses' zone of awesome bedtime suckers. The kids begin to rustle with wild nerves, having been awarded time away from a teacher.",
    "It seems that Mouthoil has Upfish's beloved Bloodball, threatening to crash it.",
    "Harry cannot take it anymore. 'Ah, fuck this', he says, and he all but punches Mouthoil right in the head. But Mouthoil, being in the same little bad-boy mood, defies Harry, and takes the battle of limits up into the lower stratus. Will Harry defy Professor Catface Meowmers for a chance to totally burn Mouthoil? The wretched Harmony tries to restrain our Harry, but he is deaf with rage.",
    "Their skill is immediately deft. All the boys and girls feel like lower organisms in the wake of their god-like abilities. In dazzling aerial combat, Harry burns Mouthoil quickly. He gets Upfish's sphere back in a move that mixes martial arts with Rainbow Magic. After letting loose some steam, Harry does a few victory tricks and flourishes on his standard, school-issue broom for the sake of all the kids below. As he descends, he descends upon a crowd of homies and newly-converted homies, who congratulate and pat him. Though he is only to be plucked away from the moment by that asshole Hardcastle McCormick! Agghh! What a horrible day!",
    "Professor Hardcastle leads a sulky and punishment-expecting Harry down the hallway to the Defense of the Black Arts classroom. She then asks a lizard-hugging, stuttery professor Queerman if she can see the student known as Major Wood.",
    "Wood is the captain of the Cribbage team, and Harry sees him as a Greek statue, an Adonis in witches' clothing. Clearly somebody that Harry can relate to.",
    "Now, dear readers, imagine that song 'Eye of the Tiger', for Harry has been chosen as the new seeker of Gryffindor. His buddies all fall in behind him as they strut through the halls. This is a procession of cool kids. Every student dreams of knowing them. But, cavalierly, H. P. and the Effin' Bear decide to break away from their homies' entourage and talk over some personal business. Though soon, right afterwards, they are accompanied by the Wretched Harmony and cannot go into details about their boys-only-style thoughts.",
    "But hello! Her usefulness again shows through as she decides to take Harry and Ronnie to the trophy case of honours.",
    "'Behold!' she manages out of her horrible mouth. 'Your dad was also a badass.'",
    "Chapter 16 As the three are making their way thorough the stairwell, naturally one of those buggering staircases shifts its course and sets them on a peculiar level. The kids, having nothing else to do to-night, their potions mixed, histories read, frogs destroyed, they decide to follow fate's lead.",
    "But the three are able to deduct that they are indeed on the forbidden third floor, and, if found, they will be killed on sight, no questions asked. Before they are able to decide whether to continue their investigations, the three turn around to see the Blood-Eyed Cat of Security, who indeed sees them, too. They make haste through the cobwebbery and darkness, like blind little cave-fish, hungry for eyes, or a reason to have eyes, only to meet another dead end.",
    "'Freakin' door! It's fucking magic-locked!'",
    "Ronnie the Bear quakes, but the Wretched Harmony casts a spell so badass that the lock falls apart and becomes a gas of rose petals that goes up their noses like a baby's challenge. They are in! And just in time. The Blood-Eyed Cat must have summoned its manservant, Dazzler, who idles like a van whose destination is being reconsidered.",
    "They are indeed in, but not away from danger, dear readers. Because lo! lying before them is a super-sized portion of God's freak-show creations. A three-headed, giant dog! And it's getting out, out of a dream, a dream of eating kids, one for each head! And hurrah for the dog! The dream has come true! Obviously, it is still sleepy, for our three heroes are able to bar the door against it and get away safely.",
    "Harry puts up with the Wretch bickering with the Bear over the practicality of a hungry, three-headed, giant dog in a school full of tasty kids, when the Wretch points out that it had to be guarding something.",
    "Harry takes note of this, and out of respect for her detective prowess, lets the Wretch vent a little while before he takes his leave of her with the Bear.",
    "Both he and Ron are hoping to score a few bottles of red wine to go with the olives that they pinched from the kitchen earlier.",
    "Chapter 17 Harry can hardly keep his heart in his clothes as he walks on to the Cribbage field with Major Wood: his first lesson in the sport that could give him an outlet for his gathering rage and power.",
    "Major Wood's accent is so thick Harry only hears it as a sort of music, a music from a shiny, muscular horn. A music of brotherhood and balls.",
    "Harry doesn't care much for the game's histories and specifics, but his ears perk up when Wood comes to what Harry is supposed to do. He hands Harry an ancient, leathery club, and Harry forces down a nervous throat lump. Next, Wood releases a ball that seems to have a will of its own. With all questions of what to do dissolving, Harry becomes the club and crashes it out of the park! Wood is obviously impressed, and Harry feels a relaxed joy.",
    "Harry knows that passion needs a vehicle, and chasing balls and wielding clubs seems pretty sweet, but Harry doesn't feel totally lost in these elements of the game. He still feels like the Harry without a home. A home where he may go wild is still not yet a home for him.",
    "It is at this moment that the Golden Snitch is produced.",
    "Harry immediately is nearly out of his skin with excitement over this ball. His destiny is here in this orb. He can feel it, like someone just kicked him in his fruit-stand.",
    "'Catch this ball, Harry, and we win the game.' Harry's face explodes in a smile. This orb seems plucked from under Midas's tunic.",
    "The Snitch then begins a clockwork striptease, and takes it into the air. It licks and beckons lasciviously on the wind. Harry is at home.",
    "Among totally What-the-Fuck?-styled faces, Professor Ugnaught starts off a class on levitation. All the kids sit, bored out of their asses in what looks like a courtroom. Feathers in front of them, wands firmly brandished, every child is going through the movements of the Levitation Spell, but their minds are on that weirdo teacher. What the fuck is he? I mean, just look at him: he's such a little weirdo! They all try very hard to pay attention, but his voice chirps out of his little bundled-up body in jerky attacks at normalcy.",
    "Every child thinks this but Harmony. Harmony being so wretched herself, she feels quite at home with the hideous creature, and is able to levitate her feather with no trouble.",
    "The Bear, being so disgusted with Ugnaught, turns his attention to Harmony. She seems to think that Ronnie can't do a simple Levitation Spell, and makes a big to-do about her quick-witted abilities.",
    "Her spell is a delight for the professor. His head looks like a happy pizza, left in a chicken house, covered in feathery bird sweat and oily discharge. Yuckers.",
    "Harry only sits there in a stupor. He, too, is overwhelmed with the talking pizza.",
    "After class, Harry, Ronnie, and the boys walk together, doing impersonations of the Wretched Harmony when the desperate creature herself bustles by, obviously hurt very deeply. H. P. knows he's got to make it right, even though it feels so good to make it wrong.",
    "Chapter 18 Halloween! Yes!",
    "Gorgeous, floating Jackie-Os in the cafeteria, and every student is feasting. The spread is beautiful. Apples, candied apples, appled candy, candied whiskey, apple fritters, anything you could ever want.",
    "Upfish informs H. P. and the Bear that Harmony has locked herself in the bathroom. 'She's been crying all day.'",
    "Harry feels guilt pangs about this information, but Ronnie, Ronnie the Bear, he could give a fuck.",
    "Just now, Queerman busts in, rambling in incoherence, but, after a while, everyone makes out that he is warning them of a horrible troll, loose in the school. Everybody freaks out. Apple chunks are cannoned by screams, floating jack-o'-lanterns fall from the sky on to kids' heads, but the Near-Dead Dumbledore commands everyone's attention with a mighty roar. 'Don't panic', he says. 'Teachers, grab your spell bags. We will find this fucking troll, and we will fucking kill his fucking ass.' He means business, and everyone takes it seriously. Snake, however, seemingly scared out of her bloomers, disappears out the side door in cowardice.",
    "As the Gryffindors move towards their rooms of safety, H. P. and the Bear realise that Harmony doesn't know about the troll, and is in certain danger. 'This is the perfect chance to make it up to her. We'll save her, and, if we're lucky, we can sneak a peek at Dumbledore's chops.'",
    "Then, running through the hall, they see the giant-sized troll's shadow going into the girl's crapper. Jesus, Harmony is in there!",
    "Harry doesn't think. He knows what he must do.",
    "Through teary eyes, Harmony looks up, and up, and up and up and up again upon a troll, huge with pineapple legs and a giant turkey drumstick. Wisely, she slowly backs away and tries to hide in a toilet. But the troll will not have it. He swings like a drunken major leaguer. But triumphant music appears! H. P. and Ronnie the Effin' Bear bust in on that troll and start selflessly defending the wretched girl by straightaway barraging that troll with spells that even mountains could hardly weather. The troll is so stupid, though, he does not even register the pain, but, oh, he is dead-set on destroying Harmony. He goes at her again with the club. Crash and Whoosh!",
    "Crazed with fists of fury, Harry brandishes the crap out of his wand and springs on to that troll's head, no problemo. He shakes that troll back and forth, and rams his wand up into the nose, poking over and over what has to be the smallest frontal lobe in existence. But that troll gets lucky, and he grabs Harry and holds him up by his leg. He is about to bash him with his stupid drumstick. Whoosh! Whoosh! He's just barely missing.",
    "But, now, who but the brave Ronnie the Bear whips out the old Levitation Spell and hovers the troll's club overhead? Only to command it just right back down on to that troll's grody face. 'Thank God for that hideous pizza that taught me that move', whispers Ronnie to himself.",
    "The giant wobbles in a last dance of bodily, knee-jerk aftershocks and falls into the conquered position. The kids stay on their toes but wipe the nervous moisture from their brows. Harmony peels herself from the wall. This is the kids' first kill, and they're understandably shaken. Harry reluctantly retrieves his wand in its most boogery, boogery state.",
    "Just as the kids are regaining their cool, Hardcastle McCormick and a gaggle of teachers, Snake included, rustle into the bathroom. She's pissed over the kids' safety being compromised, and on the edge of a spastic dookie when she sees the troll's body.",
    "But Harmony steps up to the bat and lays it on the dotted line. 'I was in here, crying like an idiot, and these badass new gods came in and saved me. If it wasn't for them, I'd be in that troll's stomach, for sure.'",
    "Then, dear readers, Harry notices a tear in Snake's pants, and blood all over her leg, and Snake notices that Harry has noticed, and he notices that she noticed that. I mean, there is a trade of noticing going on that is just bewildering!",
    "Hardcastle then scolds Harmony and demerits her a hard twenty points. Ouch.",
    "Chapter 19 Lunchtime. Harry and the Wretch are eating with the Bear when, out of the blue, Snake appears at their table.",
    "'Nice work on the troll thing', she says, eyes shifting. 'I wish you luck to-day in the Cribbage match.'",
    "Harry responds in his brain with, 'I wish you luck on not hating your parents for mixing up such an unthinkable person.'",
    "Snake hobbles off, and Harry notices the limp and begins to tell his friends that he suspects that Snake let in that troll last night as a diversion, so that she could try to get whatever that three-headed dog is guarding. Whatever it is that Snake wants is probably the same thing that Hagar got from the vault. Harmony's brain burns at a mean rate. She says that whatever is being guarded by that dog is important enough to Snake that she might, if she hasn't already, make a pact with Valmart.",
    "Just as the clues are starting to come together, a special delivery is dropped for Harry by a post office bird. The package is looked on dubiously, but soon the three are tearing away at the paper, wondering about its contents.",
    "'Willikers! The broom I wanted way back in Calgon Alley! The Necrobenimbloalaphasagoso! Who could have done this?'",
    "Well, well. Maybe it was 'Softcastle' McCormick. Wink wink, Harry, wink wink.",
    "Now imagine a music, dear readers, heavy with cellos at a rapid staccato, cellos held between thighs in a dark room, the little room of Harry's chest as he walks with his teammates to the opening gate of his first Test of Cribbage. They are a rag-tag group of champions, this bunch, and, with Harry, the near-perfect new god, they know they will dominate the day.",
    "Harry is a world laced with rivers of wizardly blood. He is ready.",
    "As the sun streams on their faces, he throws his leg over his steed and begins to rip the air a new one. His teammates and he swim through the air, testing out the space of the enormous field of play as the announcer squawks a fact that begins to drive the blood up in all of the chilled spectators: Gryffindor versus Slytherin!",
    "The autumn air puts up an icy fight, but the heat off of Harry alone warms the airy playing field. Whoosh and whoosh! The players take their positions. All of Harry's worries and hang-ups and personalities are left in the locker room. Here, it is only the seeking machine that is Harry Potter. He is so ravenous he can hardly keep from flying over and chomping the fingers off his opponents in a gesture of what's to come.",
    "'Just blow the fucking whistle!' he growls.",
    "Soon, Professor Catface Meowmers is on the field. She makes sure that the players are in position and then releases the balls. That Snitch brings the animal in Harry right up to his eyeball skins. That Snitch is Harry's desire, his fucking life. Harry knows what he has to do, and I'd warn God himself not to get in the way.",
    "The big ball is tossed and is hauled around the court by a beautiful girl from Gryffindor, who, without hesitation, crams a few points up Slytherin's bum with an effortless play. She will indeed be an asset for the few years that she will attend Gryffindor.",
    "There are high fives and claps, and the ball is back in play, Slytherin's favour.",
    "The crowd is half-frozen and unresponsive. I guess they need blood splattered all over their faces to keep them from yawning.",
    "Now, the most hideous boy in the world has the ball. He has a lumber pile in his mouth that he is calling teeth, and he is a mean S.O.B. He goes for some points, but is denied by our bloodthirsty Major Wood.",
    "Swarm, swarm, swoosh and swarm, the ball goes back and forth again.",
    "Beautifully powerful, earnest warriors of Gryffindor handle the ball and release it as a team past the obviously inexperienced Slytherin goalie.",
    "'Fuck yes!' Harry releases a primal yalp. Surprisingly, again, the crowd seems sedated in the presence of such history-making titans.",
    "The ball is again Slytherin's, but is again denied by Major Wood. Joey Lumbermouth, though, pounds the ball right at our goalie and Blammo! He is down and out on the sand, cold. Harry positively ignites with rage, and Lumbermouth shows his namesake as Hardcastle McCormick worries under her muffed ears.",
    "The game proceeds and Slytherin decides that they will just burn a few points without the watchful eye of Wood. 'Fuck!' Harry snarls.",
    "The game proceeds again. Harry could kill everyone for this. Woodpile and Ernie play rough and unclean on a beautiful Gryffindor player. Those boys are just fucking awful. They railroad her into the bleachers, and down she goes.",
    "'Fuuuck! Fuckin' shit!' says Harry. Harry is all but Hulking out at this point. Everyone is outraged as Slytherin scores again.",
    "The game is tied at",
    "Chapter 20 And Harry is a pensive, hungry falcon. Once the Snitch twitches into Harry's view he is off in a meteoric streak of red. But, just as H. P. zips after the Snitch, his broom starts freaking out. It's as if someone had a hold of the broom and was trying to shake H. P. off. 'Is he a bad Seeker?' the crowd asks. 'No, I just think his broom is cursed.'",
    "Harmony, though her Ocular Enhancing Spell, spies Snake. Snake! Oh my God, of course! She's putting a spell on Harry! Ahh! Something must be done! Ronnie the Bear curses that Snake a good one as Harmony creeps away. Harry continues to flop and roll in the air, like a doughnut of sorts. His safety is an afterthought; that Snitch has teased him into a frenzied maniac! Mouthoil is overjoyed, Snake continues her magical broom shaking, and Harry yells fuckword after fuckword.",
    "Harmony, though, like a phantom, creeps up the darkened backside of Snake's bleachers. She is so worried that Harry will die—he is the only person who is nice to her! So, she conjures up such a Hotfoot Spell that Snake will have to remember it long after she is in the grave, where no more Hotfoot Spells will ever tread! Eh! Yes! Snake begins to be so distracted she wrecks all those around her: Queerman, Velázquez, Monster Mash, Zoomacroom, they're all pissed for Snake tossing about so wildly, and Queerman is oddly intent on the game's proceedings.",
    "But Harry, Harry has gained control and is after that Snitch like a fucking rocket. Ziff! That Slytherin Seeker has been after it for a while, but I feel bad for him, because he is stupid, and Harry is a rocketized animal who will stop at nothing. Yes, they crash each other as hard as they can as the Snitch leads them straight down, that Snitch leads them down, right down into certain doom!",
    "Are they going to crash? Yes, they're going to crash, but Harry loves death. He says, 'Bring it on.' He is like a demon, long dead, with nothing left to lose. The weak-ass Slytherin pulls away, but Harry pulls up just in time. He is standing on his broom like it is an extension of his body. He reaches out, almost having the Snitch, but he stumbles and falls.",
    "Oh my God! Is Harry going to vomit? Of course not! Like a viper, Harry used his voracious mouth as his catcher. He's got that Snitch in his animal belly, and Pop! it is out! They've won! One hundred thousand points for fucking Gryffindor!",
    "The crowd goes absolutely bazonkers! The champions in red and yellow are the victors, and Harry is spent. The crowd is destroying its throats calling Harry's name. Harry feels right with himself. He's down there, a new god who has found a calling.",
    "He holds up that Snitch and bellows:",
    "'I am a beautiful animal!",
    "'I am a destroyer of worlds!",
    "'I am Harry Fucking Potter!'",
    "And, dear readers, at last the world was quiet.",
    "Chapter 21 Obviously, our friends have explained to Hagar their fears about Snake. But Hagar won't have it, even when Harmony explains the spell she saw Snake doing, and the bloody leg, and the hotfoot she gave her. All this does nothing for Hagar.",
    "Hagar tells each of them to bugger off. And then, in his rage, he accidentally drops the name 'Nick Flannel' in association with Dumbledore and the gunnysack.",
    "'Fuck!' he yells so loud that the birds rattle out of their trees. 'You fuckers made me spill the beans.'",
    "The kids are unmoved by his outburst and press on with questions. 'Who's Nick Flannel? What's in the vault? Are we to die in our beds, Hagar?'",
    "Hagar apparently has had enough of the questioning and turns to leave. Harry notices that he leaves with the face of a leaving father, a father that leaves forever, if you know what I mean.",
    "Christmastime snowiness flakes the castle gently. The scene opens with Hagar the Horrible dragging through the snow the largest Christmas tree available. High, happy music follows him in. There is a busy-bee atmosphere: not the usual busyness of the school, but a selfish exodus of students packing and grovelling as a few gross-out teachers decorate for no-one.",
    "Harmony makes her way through the mostly empty cafeteria and sits down with our heroes, who are testing their strategical wits with a thunderous game of chess. Though Harry is Ronnie the Bear's superior in most fields, it is strategy and planning that the Bear is known for, among other traits, I'm sure.",
    "Harmony feels small in their presence, so she decides to split hairs with the Bear.",
    "'Say, Ron, you look tired. Have you ever been tested for diseases?'",
    "Ron replies, 'At least I'm not a hideous fucker.'",
    "She says, 'Are you going home for Christmas? I'm going home. My family's got money.'",
    "He says, 'No, we're staying here. We're going to find out who that fucking Nick Flannel is, and rule the fucking school. So run home and open your presents. I hope you get a new pillow to cry into.'",
    "Christmas morning.",
    "The snow of Christmas morn falls like angels' shit as Harry fumbles through his last dream and into yet another link in life's impenetrably-armored succession of days.",
    "But behold! Ronnie the Bear has assembled a fine morning's fire to take the edge off. He's wearing a sweater that he himself has made out of a dragon's hide. 'You've got a strange bag down here with your name on it, H. P.!'",
    "Harry overtakes the stairway like an oiled gazelle, and in moments is scrutinizing the gift's card like a detective. Alas, it yields no real clues as to who may have sent it. Ron watches on in boredom. He wonders what evils he could be slaying right now. But he thinks of Harry, who needs this simple joy of Christmas, and Ron, for a moment, is thankful for his own gigantic family.",
    "Harry, from the bag, displays a sick-looking, out-of-fashion cloak. Ron jokingly demands that Harry has to model it.",
    "But lo-ho-ho, dear readers! It is a cloak, a cloak indeed, a cloak with a cloaking device! An Invisibility Cloak!",
    "Our two heroes stand for moments pondering its uses, the dastard halves of their juvenile minds running wild before a practical use presents itself.",
    "Chapter 22 The scene opens in the school's library, and a mysterious floating lantern is making its way alone in the darkness. It is our velveteen Hamlet, tipping on toes towards the restricted portion of the library. Once he is in, he is scanning and scrutinizing the spines looking for two words: 'Nick Flannel'.",
    "Impeded by its heaviness, and feeling like a 'fraidy cat, Harry casts off the cloak, feeling brave enough to challenge anything. Once visible, he draws a random book off the shelf to sample some of this over-talked-about, restricted content. But, first thing he sees is—Waaaaagh! Just as Harry was about to demand of the face book the whereabouts of this Nick Flannel, the screeching voice of Dazzler issues through the halls. It's such a grinding tone that Harry's handbones vibrate and drop the lantern to the ground. It breaks loudly. Now, Harry knows he could easily take this weenie Dazzler, but now is not the time or place. Invisibility on.",
    "Hunching through the library, Dazzler unknowingly grazes by our hero, who is as stealth as a kitten in mittens. Dazzler is a man who obviously has never heard the laugh of a lover, never heard the phrase 'You are fine' from a doctor.",
    "Harry exits the library as his heart goes out to the man who is servant and friend only to a cat with bloody eyeballs, when, speak of the Devil, the cat, the Blood-Eyed Cat of Security, sees Harry! Obviously the cloak does not work on animalia!",
    "Harry quietly treads around the corner, and, dear readers, he stumbles on to Snake and Queerman, having an excited talk up against the wall, very close and breathy, in the dark, romantically arguing heatedly. Snake is demanding loyalty or something from Queerman, and Snake seems to hear Harry, oh God, Harry you're breathing too loud! Breathe into your sleeve for God's sake! Harry backs away just in time.",
    "And Snake finishes her conversation; their eyes display nothing and everything. Dazzler is now upon the professors, and displays the still-hot lantern that was dropped. 'The gig is up! There were kids, kids in the adult books!' Snake is off, and Harry creeps like an icy ghost down around the halls.",
    "Chapter 23 He leads himself into a room that he has never entered, just in case they look for him where he usually goes. The room is huge and empty, and Harry's eyes take a while to adjust to the darkness. As they begin to focus, he asks himself, 'What could that be way in the back, up against the wall? Is it a king's mirror, a giant's mirror? Why not take a look', thinks our hero. 'Why not take a deep, telling look?'",
    "The mirror is warm and perfect, the reflection has no warbles, the form stays true when you move. But as Harry gazes, the mirror activates his magic eye to reveal a secret image.",
    "'Oh, my God! Could it be? Are those my parents?' Harry asks. Harry knows they are dead, but could Heaven be here in this cold, cold reflection? The parents seem to animate and respond, 'This is Heaven's entrance.'",
    "His mother, she is beautiful. The guy, he seems pretty cool, too. He reaches out to feel the blue face of his world's perimeter. He wonders what it would be like, what it would have been, if these people would have remained.",
    "Harry feels his trapezius along in time with his mother. 'This is mine', they both say in scary, scary unison.",
    "Next thing you know, Harry is busting into Ronnie the Bear's chamber, disturbing him out of a beautiful slumber. If this is indeed the Gate to Heaven, he and his champion must enter it together. They swiftly navigate the castle's hallways and cast away the invisibility cloak once in the room of mirrors.",
    "When Ron the Mighty is stood in front of the Gate of Heaven he begins straightaway to denounce it. He cries, 'Heaven is for those too scared of nothingness! I will go no further than my mortal flesh will carry. This mirror is the sick bed of Heaven, Harry! The eternity of pansy lives!' Ronnie will have nothing to do with the mirror. He is only concerned with the flesh and the blood of the now.",
    "This destroys Harry. Ron leaves him to contemplate the design of the cosmos versus the terminal beauty of being a wizard.",
    "For forty-three days straight Harry sits in front of the Gate of Heaven, waiting for either God to appear, or for Ronnie to come back and apologise. But, to Harry's surprise, neither shows up. Only Near-Dead Dumbledore stumbles upon the vigil. Harry is considerably weakened, and is actually taken surprised by Dumbledore's presence.",
    "Dumbledore starts in. 'Don't you want some cocoa or soup, Harry? Come away from the light of Heaven's easy life. We need such a valiant, beautiful warrior as yourself here to live and to hack the serpents of evil in two, hell, into twos, into threes and fours! Your life will be the very envy of Heaven and its slobbery inhabitants. No, Harry. You were meant to stride with us, the living! To course with us and our blood. You are meant to end when your share of that blood turns brown upon the rocks of glory! You and I shall drink to-night, Harry. We shall drink to life's confines, to life's pearly end, which is the nothingness of death, not the perpetual pansiness of Heaven!'",
    "Dumbledore is shaking with passion. He is beckoning Harry to enter into the sphere of manhood. Harry is all but wrapped in a buffalo skin, dancing and shaking a bow and arrow around a ceremonial fire. His rite of passage is here, now. He's like a young Native American, preparing to answer the question of life. Dumbledore is all aquiver, awaiting Harry's answer, and Harry answers, 'Yes.'",
    "Chapter 24 It's a perfect, clear morning as Harry steps out into the muffled crunch of snow in the courtyard. Harry looks like a man just married. He does a few ponderingly-paced laps around the frozen fountain, and then decides to proceed. He sends his owl up into the clouds, and then he enchants the bird with a spell, the rarely used Winter-Be-Gone Spell. Harry is eager to get back to life as it was at Hogwarts. He is eager to have the story return to its tracks, so he and everyone else can find out what's in that fucking gunnysack.",
    "A spring sun shows Pledge streaks on a dark, wooded library where kids once again bustle about. Harmony strikes gold in a giant hardbound atlas. While she was at home she worked a temp job playing piano in a jewelry store. Wisely, she wore a hood so as to not distract the customers with her hideous visage. But, whilst in the store, she kept hearing, coincidentally, Nick Flannel's name. It was then that she began to formulate her hunch, which, here in this atlas, she confirms.",
    "'Nick Flannel was the inventor of the Sorcerer's Stone, a rock with enormous powers, such as: lead into gold, horses into gold, immortal life, giving ghosts restored bodies, frag trolls, trolls into gold, et cetera. The Stone is being guarded by the three-headed dog! The Stone is what Snake must want! She wants it so that she may live forever with a stockpile of gold!'",
    "Holy shit. It makes total sense.",
    "Our heroes walk briskly through the night, making their way secretly towards Hagar's shanty. This guy is hoarding secrets, they think. But once he sees who is knocking at the door, Hagar just slams it right back in the kids' faces.",
    "The kids start to yell out, 'Hey! What about the Sorcerer's Stone? Does that ring a fucking bell?' The giant knows they mean business.",
    "They start in on Snake and Snake's needs again, but Hagar gets testy. He explains that every teacher is protecting the Stone, including Snake, with spells, and dogs, and flying hatchets, and cats, and ancient pendulums, et cetera. He seems to be in pain. Hagar continues to seem distracted with something going on behind him. After a while, Ron gets sick of the game and just demands to know what's up with Hagar. Why does he look so haggard, and what is he hiding?",
    "Hagar breaks down and lets it all loose. 'One day a few days back, no, a few months back, I was hunting in the forest alone. I'd shot a stag and was tracking its blood trail through the forest. As I got deeper and deeper, I felt like I was being followed. I turned around and shot my crossbow, but my arrow only went through the ghostly form of Valmart. He demanded that I give him the Sorcerer's Stone, and I told him that I couldn't. He then pointed his wand at my stomach and struck me with a mighty spell. Next thing I know, I'm feeling kicking and clawing down in my gullet. This goes on for weeks. I knew that I was becoming a mother, but to what?",
    "'Later on, during a boating accident in shark-infested waters, me and some friends were stranded, treading water while sharks fed on us. One by one, my friends disappeared in clouds of blood. I alone survived, and the reason is this: my baby inside me was screaming and making such a riot in my belly that the sharks were afraid to open me up. So they let me live, and I was found later by some fishermen.",
    "'A week ago I finally birthed this egg. Apparently I am the mother of a dragon. Now kids, don't tell anybody. It's illegal to have a dragon around here, you know.'",
    "After the story's confusing conclusion, who should appear in the window but that fucking panda cub Mouthoil! After his fucking ass!",
    "Our heroes walk through the halls, talking of plans of trapping Mouthoil and torturing him, when they are stopped dead in their tracks by Hardcastle McCormick. She takes them into her office and dons her demerit costume, hat and all. This must be serious.",
    "'Fifty points deducted for each of you! It is forbidden to be out at night. All of you have detention, even you, Mouthoil!'",
    "Mouthoil tries to protest, but he is overrun by her barrage of degrading talk.",
    "'Spies and thieves!' she spits. 'Spies and thieves!' she spits. Her spittle becomes an acid and flies on to each of their cheeks, burning their little cheeks with pockmarks as reminders of their transgressions. They shall never, ever forget.",
    "Chapter 25 Later that night, Dazzler leads the four kids out to their duty of detention. It turns out they have to hang with Hagar in the old forest all night long. Yuck! Soon, they are up around the crossbow fire where detention always gets started. Hagar mopes and speaks about his dragon flying off on him in the night, and how he's sad.",
    "'Dragons have no heart', he blubbers.",
    "The cat's whore, Dazzler, winces and grinds out words as he does, but no-one seems to care, not one fucking soul. But he goes on to grind out sentences, possibly on werewolves, possibly on nothing. Blahhh. His voice is as hard to listen to as a dying loved one calling out to you for help when you are restrained. He gives up on using his words and tries to communicate with only his eyes. Oh, how they bulge and struggle to convey unthinkable meaning! He is trying to say with his eyes that the kids will surely be destroyed in the forest to-night, so it is just as well that he is indecipherable to the children.",
    "Finally, after all of this, Hagar breaks up the stream of incoherence and signals that it is time to go. He grabs his crossbow and his scabbard full of arrows.",
    "Leaves are even scared of this cold, evil place and never settle, but try to ride wind out from among the trees that have dropped them.",
    "Hagar, after a while of tracking, kneels down and knowingly dips his finger into a shimmery pool of unicorn urine. He explains that a prize-sized unicorn is nearby, and, with their help, he will kill it with his crossbow and win a prize in a local contest. The kids seem truly interested in the hunting lore that Hagar bestows: unicorns travel in pairs, unicorns are white, unicorns like apples, et cetera. Hagar seems put off and distant, sullen. His dragon baby has clearly run away with his heart.",
    "Hagar decides to split up the group, and everyone is eager for the hunt. Harry and Mouthoil are teamed up together. Now, Hagar only does this because Harry is an enormous threat, and, even though Mouthoil is a son of a fuck, he is a powerful little puke. So the two are put together, seeing how they'll probably do fine without the help of Hagar and the Crossbow of Kazakhstan.",
    "Harry and Mouthoil take the north part of the forest. The other people take the rest, the south and the west. Harry and Mouthoil talk of nothing. Their hatred for each other curls about their temples like Caesar hats.",
    "Their crazy-looking dog seems to have picked up the unicorn's scent, and they make their way into a grove of cool dirt and shade where they believe it is bedded down, an inviting nap place, indeed. The smallest little cloud is already snoozing here.",
    "But, what the Christ! They are too late! Their unicorn is already fallen under the hand of some Dracula. Harry's scar starts to hurt like it's fresh, and, right when Mouthoil has a chance to win points with the H. P., he chickens out and vanishes, leaving Harry alone to deal with this shade. Oh man, does Harry boldly stand his ground against the Dracula! Harry totally hates detention, and this prize unicorn is his ticket out. If he has to get a little dirty to get what he wants, then fine.",
    "Harry believes this to be some lower-class woodland Dracula and doesn't ready the big spells. but, to his surprise, the spectre is not afraid of him. He must think Harry is just some common first-year. Harry has to back up against a tree's tangle of roots to try to drain some back-out power, and to make a larger spell.",
    "But lo! to Harry's aid jumps a badass man-horse who is kicking and threatening wildly at this prince of blood-lovers. The Dracula skirts away, knowing that his odds are way off in this battle. A man-horse and Harry Potter? No way.",
    "This man-horse knows Harry, of course, and, like all the creatures of the woods, Draculas and werewolves excluded, he would gladly die with him in combat. Now, the man-horse explains quickly that the Dracula was actually Valmart, the scar-artist, and that he, Valmart, is trying to get the Sorcerer's Stone.",
    "Master P. then puts to the man-horse a few well-chosen detective 'questions' like, 'I thought it was Snake who wanted the Stone.'",
    "'No, Snake may be involved, but it is Valmart who really wants to use the Stone.'",
    "Right now, dear readers, the horseman leans in close and begins to blow the doors off of our hero's reality. 'Valmart is your father. That other guy is your step-dad. Your arch-enemy, the guy who tried to slay you, the guy who slayed your mama, is your dada. Your dad is a Dracula.'",
    "Harry just goes ahead and vomits right all over the man-horse's shoes. Tears mix in with the sobby throw-up, and Hagar offers to call detention off early under the circumstances.",
    "Chapter 26 Gathered around the fire, four or five cognacs down, our threesome unwinds and works out the details. Neckties loosened, robes unbuckled, they are relaxing. Yes, they were sort of wrong about Snake. She wants the Stone, though not for gold, but to resurrect the Dracula, Valmart, so that he can have a new body and stage a rematch with Harry. The three know that Harry is a badass, godlike animal, but if Valmart gets the Stone, he may kill the Near-Dead Dumbledore and take over the school.",
    "Harmony takes a giant swallow of cognac and says, 'He was never a dad to you, Harry. You know, you're going to have to fight him. You're going to have to beat him.'",
    "Harry knows that this is true.",
    "Finals! The courtyard looks like an anthill. Our three stroll confidently, but Harry seems to be nursing a head that dealt with one too many cognacs. The tests are pretty easy compared to the shit these kids are dealing with in their free time. Harry sometimes wishes his life was as simple as Upfish's.",
    "They talk of lunch and break on to the common ground when a child-summoning tone flows over them and they are helplessly compelled to Hagar's hut. Hagar has done a little headwork lately and decides to confess that last night he told a Dracula-looking dude in a bar that the three-headed guard dog falls asleep easily when he hears music. Hagar had to summon the young detectives to get this off his chest.",
    "Harry is inconsolable. He talks right over Hagar. 'What could have made you say that? What do you think this is, a fucking free-for-all of facts? Why don't you go and get on the school P.A. and tell everyone my dad is Valmart, and that I'm half Dracula? I mean, what fucking good are you? Why don't you learn to keep a goddamned secret, you hairy piece of shit!? God!' Harry is ragged. He has had a long day and good manners are secondary to his cause.",
    "Next, Harry and his team rush into Hardcastle's class, all gangbusters. They start explaining that the Stone is in danger, and that they have to get Dumbledore in order to protect him. Hardcastle is just flabbergasted with all this news. She informs the kids that Dumbledore is in London for the weekend.",
    "'Crumbs and carrots!' cries Harry. 'The Stone is doomed!' He goes on to say, 'You better be up there guarding that Stone personally, Hardcastle, because if it's gone, and Dumbledore gets hurt, I am going to hand you your ass when this is all said and done!' He is ravenous at this point. 'Fuck this!'",
    "Out in the hall, just as the three detectives are beginning to formulate a plan, who but Snake arrives and darkens the hallway with her black robes galore? Again with the face, again with the eyes.",
    "'What are you kids doing here?'",
    "'Well, we fucking go to school here.'",
    "'You will be schooled here.'",
    "A staring match ensues. And, of course, Harry is the victor.",
    "As Snake takes her leave, Harry turns to his brother and sister in arms and declares, 'I will feel her blood on my hands to-night!'",
    "Chapter 27 A disturbingly meaningful fog hangs cataracts all over Hogwarts. As our heroes walk down into the Gryffindor common room, they see the frog reclining in the armchair that can only be owned by our friend Upfish.",
    "Upfish, in a foolishly loving gesture, tries to keep our heroes from tasting victory to-night. He puts up his little dukes and sucks in his quick, stupid little breaths. He is sweet, but he is being a nuisance. So Harry, wasting no time, dispatches Harmony on Upfish. A quick Popsicling Spell, and Upfish is out. They nonverbally decide to just leave him there, without a blanket, so that maybe he can think about what he's done, and what brotherhood really means around here in the Gryffindor School.",
    "Under the cloak of invisibility, the three make their way up to the Chamber of Secrets, where the dog lies on that trapdoor, and where all adventures begin. Again, Harry lets Harmony take the lead. She is just so much faster with the Lock Spell than he is. The lock is turned into a dove, and the door is slowly advanced open. But the children are disgusted to see that the dog is already fast asleep. Snake has already beat them to it and has set up a magical harp that cradles the dog's brainfruits somewhere far away from the now.",
    "Our heroes sadly begin to set to work, playing catch-up, moving the dog's hoary paws off the trap door. This isn't as easy as it sounds, for they have to do it noiselessly, like fucking mimes forced into slave labour. They bite back their grunts and muscle whiffs, and Harry notices a strangeness. It's too easy, and it's too quiet, and, oh shit! the music has stopped!",
    "Just then, the giant dog awakes itself and is just much faster than last time. It's so fast, dear readers, that you guys can't even see that it just goes right ahead and takes a big chunk out of Harmony. He bites what is most of her head off. She is dead in an instant. Harry blacks out. Out of him come powers no-one even knew existed. Time is stuck on the cog of Harry's will. He turns the dog inside out and then dissolves it into a pudding. Harmony is in two pieces, but Harry, with eyeballs turned completely white, recapitulates her form and blows life into her. She is full, and is the Harmony of old, and is acting like nothing ever even happened. So Harry comes out of the power coma and thinks nothing happened, also.",
    "Time resumes, and they jump through the trap door on to what I guess is a wad of leathery roots that start to seem hell-bent on rending the wizard kids limb from limb. Their bodies become ensconed in the wet black leather, sinking like in quicksand into the wads of captivity. Harry can't help but notice the coincidence that last night he ate spaghetti. It's funny to him that what's trying to kill him on the outside is just like what's nourishing him on the inside.",
    "Harmony has escaped with some sort of shrewd spell. She tries to explain it to the others, but they just can't understand it. She goes ahead and casts a Releasums on Harry, and he is freed. She tries also on Ronnie, but it just doesn't work. She tries over and over. Why won't it release Ron? Does it know that it can live on the sustenance of such a warrior for years and not need worry about eating or drinking? Well, whatever the spaghetti is thinking, Harmony again proves herself and blinds the wad's hidden eye with some crazy Sunburst Spell and it releases the Bear. He is freed, and they are now able to resume the hunt for the Stone.",
    "After scraping off the spaghetti's fluids from their flannel jackets, Harry is impressed and actually says aloud to Harmony what he has been thinking for a while: 'You're amazing.'",
    "Chapter 28 Harry is totally uninterested in this next challenge. He runs through this problem like a set of crunches as his mind's eye daydreams again. He sees himself dressed as a conquistador, crashing in the faces of werewolves and bigfoots with an enormous telescope. He then goes on to envision himself arriving on the coast of a then-undiscovered America. He mingles peacefully with the natives, and trades secrets of magic with their shamans. He makes friends, and blends bloodlines of greatness. He teaches them wizard spells, and they in turn teach him how to fly across the continent at ridiculous speeds. He learns to slay deer with laser beams from his eyes, and how to make all things around the house out of buffalo parts.",
    "Harry could live with a woman who has strong, magical jet-black hair. She'd be enchanted, and almost a giant. She'd carry Harry around on her shoulder as she walked through the forest, and he'd hold on to her perfect ear, smiling. They'd fly off into the clouds and spend weekends up there, dictating the North American weather patterns. He'd need not worry about clothes, because he'd wear those strappy skirts that were popular back then in America.",
    "But that world of America, of light and natural beauty, and of those people, who were so one with the perfect ecosystem, that world dissipates, and Harry is back in the dark, hoary bowels of storm-ridden England, trying to save all of wizard-dom from his crazed, Dracula-ghost father. Harry almost sobs, but moves on. He is a true champion.",
    "As the three traipse through the dark hallways of Hell, they come upon a challenge fit for only a bear. Giant, sculptural figures stand in two lines of two, opposing one another. This could only mean one thing. It is the famous chess board of Ragnarök.",
    "The Bear enters out on to the board like a World Series winner going for one more World Series win. The board is then illuminated by a magical florescence. The deal is this: Harry and the gang cannot pass without winning this game. It is a raw deal in red heat: you lose, you die. You know the kind, I'm sure.",
    "Soon, it becomes apparent who should take charge of this part of the challenge. Ronnie the Bear begins to dictate how the next couple of moves will happen. 'OK, listen up. I will take charge and make all the moves. You guys keep your mouths and keep out of my way. You act as a rook, I guess, and, Harry, you act as a bishop.'",
    "Harmony farts a nervous fart, but no-one cares. Every one of Ronnie the Bear's atoms is focussing on the task at hand. Imagine God creating, and then you will have a beginning of an understanding of the Bear's massive cerebral cortex at work. This invisible opponent must have invisibly shat himself after Ronnie's first move, knowing full well the challenge that he was about to face. Every battle the earth has witnessed looks like a Three Stooges' scene compared to this match. Patton, MacArthur, Custer, and Charlemagne look on as astonished ghosts, stuffing their mouths with popcorn and jujubes.",
    "The game goes on like Napoleon on Ice, a perfect mix of speed and precision. The pieces explode and crumble and move into position by the will of one, one Ron Weasel, a.k.a. Ronnie the Bear.",
    "There are struggles and losses and pursuits and beheadings. All of the pieces crumble, all of the pieces turn dastardly towards violence, but nothing happens that is not the consent of the Bear.",
    "We get down to where the pieces are only a few, the desert portion of the game, where a skeleton can kill a buzzard if the buzzard is really stupid.",
    "Chapter 29 Here now, in the rubble of the last quarter of the game, sacrifices have to be made in order to gain the checkmate. The Bear's face is a phosphorescent mask of jelly. He is at the last strands of sanity, and his mind is swollen, invisible behind his retinas. He is mad with the satanic desire to win at any cost.",
    "'I will die for this!' he says. He is a veritable milkshake of all of the past generals' strategical centres. He takes out a flask and sips a bit of peach schnapps. And then he yells out to Harry, 'You can keep my stuff, if I don't survive this! You know it's sweet stuff, man! Just take it!' And he moves himself into formation and out into danger.",
    "He is putting himself up to the king and is putting that king into check, knowing full well that the queen will come over and have his balls for this. It is a move that everyone knows, and everyone has to do, but when you're not riding a giant horse out there, and it's just a little piece in your hand that you're sacrificing, it doesn't feel quite so heroic. But believe me, here, on this board, in Ragnarök, it is.",
    "Ronnie steadies himself and gazes right into the slit of the helmet, looking for some sort of eyes, some sort of response from his executioner, but there is none. And Ronnie the Bear, Ronnie the Bear quakes and is felled. Chunks of his horse spray-paint Harry and Harmony. She almost goes to Ron.",
    "'Don't fucking move! We finish this now! It's how he would have wanted it!' Harry screams this as he moves like a bishop right up to the face of that king. He takes out a glove, and he slaps that king right in the face. 'Checkmate, you asshole. That was my best friend.'",
    "The game is finally over.",
    "The two, after taking the Sword of Defeat, decide it is safe to run over to check on the status of Ron. 'Is he breathing? Is he dead?' Harmony nags Harry. 'Why did you let him fall?'",
    "'One more complaint out of you and I will erase your ass! You understand me? I'm sorry. I'm sorry. It's just the pressure talking.'",
    "Harry takes a deep breath and remembers what he's down here for. He goes on to instruct Harmony to stay with the injured Bear, make sure his vitals are clean, and to call the president if he's not back in an hour. He knows what is next, he feels it, and he is ready for the challenge.",
    "Chapter 30 As Harry walks down into his fate, he comes to realise that this is the moment beyond games, the moment he has been waiting for. No matter what happens, he is where he should be.",
    "Before him, down the darkest of stairs and into the cellar, standing before the Gate of Heaven, why, it isn't Snake at all! It's Queerman! Queerman! Queerman tried to kill Harry in the Cribbage match! Queerman unleashed the troll! Queerman is in league with Draculas and wolfmen! Queerman wants the Stone! It's all been an act! Harry is bowled over. He can't believe he didn't see this coming. Queerman this whole time has been Harry's dad's gofer. Snake was unfairly suspected, and is probably a lovely woman.",
    "Harry stands before the babbling Queerman and readies himself for final combat. He puts on his lucky headband and pops his knuckles. And all the while, Queerman seems to be conversing wildly with the air.",
    "Harry knows that his dad is a ghost, a ghost Dracula, and he knows that he flies around in the air sometimes, but he doesn't see him flying around anywhere here and wonders just who Queerman is talking to. The air, then, miraculously, becomes thinner, and Harry's forehead aches. The air begins to tell Queerman to retrieve the Stone using our champion, using H. P. as a vehicle, for only innocence can retrieve the Stone from the Gate of Heaven. The Stone is locked behind Heaven's gate and only a pure soul may enter.",
    "A spell is cast, and Harry is forced to walk all jerky-style right up to look into the dreadful threshold of Heaven. He knows he looks really stupid, but he cannot break away from the spell and has to peer into the mirror as Queerman is demanding to know if Harry sees the Stone.",
    "'Put your hand in there, boy!'",
    "Harry defiantly thrusts his hand down into his pocket. Somehow the Stone manifests itself into Harry's sweaty mitt. 'Oh, God, this sucks', Harry thinks to himself. But, having broken the spell with the hand thing, he decides to just back away. While Queerman is chatting up the air, maybe Harry can just hide the Stone somewhere else until he can decide what to do, once talking with Dumbledore. He makes up an excuse about how he can't get through Heaven's gate because, you know, he killed a dude a couple of weeks back, and that clearly prohibits his entrance and all.",
    "But, through Harry's excuse, Queerman is starting to take off his turban mesmerisingly, and, even though Harry should be making his way for the steps, he's always wanted to see what Queerman's head looks like.",
    "Harry and the boys have always joked about the possible hair-dos, or crazy balding—AAAGGGHHH! Holy fucking balls! There's a sick-ass face on Queerman's head! Harry almost ignites in vomit. Harry's dad's face begins to move, like a marmalade baby just out of the womb. He calls to Harry to join him, and says how they could use the Stone together and live in a golden castle and shit. Harry's scar begins to vibrate so hard and fast it causes a tone that almost makes Harry's skull shatter. He cannot believe one fucking piece of this reality. Fuck! and shit!",
    "Chapter 31 That crazy, sick-ass face is burning everything now. He wants that Stone so bad. He wants to paddle Harry so hard. He starts telling Harry all sorts of fake shit, like Harry killed his own parents but just doesn't remember, and that Dumbledore eats babies. Harry is confused and scared. This is his dad talking. He doesn't know what to believe and what to hate. He wants to run off. He imagines that that man-horse would come in here and take him away, and maybe they could catch a movie, or make dinner or something. Something fun for a change.",
    "But, finally, he comes out of this reverie and holds the Stone to absorb some of its power and then waits for the right moment to strike. The flames are licking hotly all about, driving him crazy. And that sick-ass face is still talking. It wants that Stone so bad, it is willing to burn everything, including itself, for a chance to get it.",
    "Harry can't believe it. 'This is not me. I am not my father. I could throw this Stone into a gutter and not give one fucking shit.'",
    "The squirmy dad-face is seemingly having trouble commanding its host-body and tries to get him to jump at Harry, and, after a few takes, it finally does. He lashes out on him, choking him and spitting in his face, trying to kill our champion. But, Harry gives forth a ferocious growl and burns that fucker with a Flaming Hand Spell. Queerman recoils, but that sick-ass face on the back of his head just won't have it. He will not take retreat. He continues to press Queerman to get the Stone. 'Hey, Queerman! Forget the hand, man! Get the Stone! Get the Stone!'",
    "Queerman again reaches for the Stone, but Harry valiantly lays his magnificent hands on Queerman's face, and instantly turns the entire body to crumbling ashes.",
    "At long last, Harry is in real time with his destiny. He cries out, 'I am important and unavoidable!'",
    "Harry yells down into the empty neck-hole, 'Oh! this game is over when Harry says it's over, and no-one else! Harry is the one who kills around here, and Harry has killed you! I killed you, Dad!'",
    "Harry picks up the Stone just in time to turn around and feel his dad blow through him, just as everyone has their dads blow into them like a kite, a kite of chromosomes blowing on the wind of inheritance. The stream of the ghostly Dracula exits, and Harry passes out into a deathy sleep.",
    "Harry then dreams of nothing but a black, still ocean that he is at the bottom of. His senses are all in the shop for immediate overhaul.",
    "Chapter 32 Next thing Harry knows, he is waking up in the student infirmary. There are flowers and cards from presidents, and queens, and diplomats. Harry yawns and collects his glasses. He seems pleased, like a man can seem pleased.",
    "In walks Dumbledore, near-dead and beautiful. He talks about Ron, and Harmony, and the Stone, and Nick Flannel, and Valmart, and fathers, and how sometimes fathers can show up on the back of people's heads even when you least expect it. But Harry is way beyond all that. He just wants to kick back a few cold ones and get through finals.",
    "Harry is eager to move on, and he asks Dumbledore if he has seen that man-horse around. Dumbledore says no, but Harry sees a glimmer in his eyes. Harry seems to guess that God would be happy to know that Dumbledore would try to keep Harry from such a union. But, for Harry, God is no thing to worry about.",
    "They continue to chat about death, and stones, and next year, and whether or not they plan to replace that one teacher that turned to ash, and then Dumbledore leans in.",
    "'Your dad and I, we go way back. He was an evil bastard, but I loved him. I loved him so much. He proofread my novel. He liked it. He was the only one.'",
    "This information seems to sit right with Harry. Even though he knows his dad is pretty much the quintessential evil person, he doesn't like being disconnected from his people. He then goes on to worry and wonder about his mother, and whether or not she'll return to earth in the form of a gas, or turn up hanging out on the back of some poor lady's head, or go crazy for obtaining powerful objects. But anyway, he decides just not to worry about it. As he tells Harry a funny little joke about a drunken werewolf, a crippled witch, and a fold-out couch, Dumbledore begins to pick over what's left of Harry's candies. Nurses hum and scuttle about, making little actions and noises that Harry decides perfect sounds to fall asleep to. Dumbledore, the scavenger, takes all the red ones from Harry's jelly beans. Harry, watching, seems to just not care.",
    "Chapter 33 After a while, Harry decides to leave the infirmary and put back on the cloak and tie. He walks out strong and encounters his playmates who have been anxiously awaiting him. They quickly compare notes on the adventure and exchange shit-eating grins. They all feel great.",
    "The cafeteria is a crazed sea of almost-vacationing students. The only thing that stands between the kids and summer vacation is Hardcastle McCormick's hokey points awards show. Dumbledore laments that yet another year has passed and he is even closer to his end, but soon commences in the announcing of the points.",
    "Gryffindor has a measly 312 points. The students' morale is very low at this fart of a total.",
    "Hufferpuffer has 420 points, and that's pretty good for the remedial class that they are.",
    "Viacom, well, this year Viacom has earned 480 points.",
    "And Slytherin, Slytherin has an even 6,000 points. Coming in first for the first time in front of Gryffindor, Slytherin seem to be the champions.",
    "'However', Dumbledore says, 'last minute points are thus.'",
    "Snake is seemingly on the edge of her seat.",
    "'To the Wretched Harmony, for aiding some unmentioned titans and knowing your spells in desperate times, you are awarded 300 points.'",
    "Everyone claps, and Harmony feels like she could cry out a second self of tears so that she could have someone to hug. She feels accepted, though.",
    "'Ronnie the Bear. Ronnie the Bear Weasel, you are bravery, you are courage, you are chess. One thousand points!' The applause begins to increase, as if they know who is to be honoured next and they are just getting ready.",
    "'And of course, the keeper of our hearts, and the true magician who has bewitched us all, Harry Potter, receives six million points for vanquishing the Dracula!'",
    "The crowd goes apeshit, clapping their asses off in a mixture of admiration for Harry and excitement for fucking summer-time to finally get here. The new points mean that Gryffindor are now the champs of the year. They get to hold the trophy and drink from it whatever they wish.",
    "The entire cafeteria, Mouthoil, Snake, and Pitstains included, join in supporting Harry and summer-time. The applause is gigantic. The universe only accepts love to-day, and, luckily, everyone is in accordance.",
    "Dumbledore sings a little song, a pleasant song that sounds like a flute, a flute that was designed by Jesus Christ.",
    "Gryffindor totally destroys the other schools in points, but a truly beautiful glance and wink are shared by all. The hats begin to rain upward fast, and, as always, slo-mo right back to the hands of the tossers. Thoughts of Slip 'n Slides and water-balloon wars are impossible to avoid. If you have hair here, it is going to get rustled awesomely.",
    "Chapter 34 Everyone is packed, and has emptied out their dorm rooms, and is boarding the Hogwarts Express. Report cards are being altered as we speak.",
    "Harry must have a word with Hagar the Horrible before he leaves. He tells his friends to hold up and to make sure the engineer doesn't leave him behind. Before Harry can say one word, Hagar produces a beautiful portable television with a clip of Harry's parents cued up for Harry's delight. This is the first time that Harry looks at himself in a picture, not to mention as a baby. In the clip, he coos and responds to love in the form of a tiggle.",
    "'This is really weird, man', he says, and Hagar nods, like he knows what a tiggle feels like.",
    "They hug awkwardly and talk a bit about next year's problems, whatever they may be. And then Hagar tells Harry that he's got to go trim some hedges and make things right for the summer. You know, you have to put seed down for ticks and stuff like that.",
    "And Harry says, 'Yeah, well, I've got to get back home. I've got some horses I need to check up on, you know.",
    "'I guess I'll see you.'",
    "It turns out that they do like each other, and it wasn't all out of obligation. Harry thinks that he will come back next year, and, when he does, Hagar will be there waiting, as long as God doesn't fuck anything up.",
    "The end."
]
